app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists"  ORDER BY "artists"."id" ASC LIMIT 1
---
  def new
    if params[:artist_id] && !Artist.exists?(params[:artist_id])

SELECT "artists".* FROM "artists"
SELECT "songs".* FROM "songs"
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    if params[:artist_id] && !Artist.exists?(params[:artist_id])
      redirect_to artists_path, alert: "Artist not found."
    else
      if params[:id] && !Song.exists?(params[:id])
        redirect_to artist_songs_path, alert: "Song not found."
      else
        @song = Song.find(params[:id])